from api.models import *
from datetime import time

def init_institutes():
    institutes = [
    ("Институт педагогики и психологии","ИПП"),
    ("Иститут гуманитарных наук и социальных технологий", "ИГНИСТ"),
    ("Институт Высшая ИТ-школа", "ИВИТШ"),
    ("Институт физико-математических и естественных наук", "ИФМЕН"),
    ("Юридический институт им. Ю. П. Новицкого", "ЮИН"),
    ("Институт промышленных технологий и дизайна", "ИПТД"),
    ("Институт управления экономики и финаснсов", "ИУЭФ"),
    ("Институт культуры и искусств", "ИКИ")
    ]
    i_count = 0
    for (n, sn) in institutes:
        _, created = Institute.objects.get_or_create(
            name=n,
            short_name=sn
        )
        if created:
            i_count += 1
    return f"Создано {i_count} институтов"


def init_buildings():
    buildings = [
        # ("","","",time(8, 0),time(20, 0)),
        ("Главный корпус","Гл","г. Кострома, ул. Дзержинского, дом 17/11",time(8, 0),time(20, 0)), #
        ("Учебный корпус «А1»","А1","г. Кострома, ул. 1 Мая, дом 14",time(8, 0),time(20, 0)), # ИГНИСТ
        ("Учебный корпус «Б»","Б","г. Кострома, ул. Ивановская, дом 24а",time(8, 0),time(20, 0)), # ИВИТШ
        ("Учебный корпус «Б1»","Б1","г. Кострома, ул. Пятницкая улица, дом 2/18",time(8, 0),time(20, 0)), #
        ("Учебный корпус «В1»","В1","г. Кострома, ул. 1 Мая, дом 14-а",time(8, 0),time(20, 0)), #
        ("Учебный корпус « »","Г1","г. Кострома, ул. 1 Мая, дом 16",time(8, 0),time(20, 0)), #
        ("Учебный корпус «Е»","Е","г. Кострома, ул. Малышковская, дом 4",time(8, 0),time(20, 0)), #
        ("Учебный корпус «Ж»","Ж","г. Кострома, ул. Лесная, дом 5",time(8, 0),time(20, 0)), #
        ("Учебный корпус «ИПП»","ИПП","г. Кострома, пос. Новый дом 1",time(8, 0),time(20, 0)), # ИПП
    ]
    b_count = 0
    for (n,sn,addr,st,et) in buildings:
        _,created = Building.objects.get_or_create(
            short_name = sn,
            defaults={
                "name":n,
                "address":addr,
                "work_start_time":st,
                "work_end_time":et
            }
        )
        if created: b_count += 1
    return f"Создано {b_count} корпусов"